_orgs/_posts/softwareEngineering/2021-07-03-macbook-pro.org
#+TITLE:  Macbook Pro
#+AUTHOR:    zrg
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:6 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+EXPORT_SELECT_TAGS: export
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:12px; color:darkblue}</style>
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_EXPORT HTML
---
layout: post
title: Macbook Pro
author: zrg
description: Macbook Pro notes.
excerpt: 
comments: false
categories: 
- software
tags:
- Macbook Pro
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
My email address: zrg1390556486@gmail.com
# (setq org-export-html-style nil)

* Keyboard
| Keyboard                                 | Description                                                                               |
| Option = Alt,Command = Windows           | Mac 与 Windows 按键对比                                                                   |
| Option+shift+K                           | 可以输入                                                                                 |
| Command+shift+.                          | 显示隐藏文件                                                                              |
| Command+c,Command+v,Command+option+v     | 复制,粘贴,移动/剪切                                                                       |
| Command+option+c                         | 快速复制文件绝对路径                                                                      |
| option+command+esc                       | 强制关闭应用程序                                                                          |
| Command+→ , Command+←                    | 光标移到行首或行尾和上下翻页，除了使用emacs默认快捷键外，也可以使用command键+上下左右箭头 |
| fn + <x, Ctrl + d                        | 删除光标后的字符，相当于<DEL>                                                             |
| Option + <DEL>, Option + d               | 删除光标后的词                                                                            |
| Command  + m                             | 最小化                                                                                    |
| Command + 0                              | 显示最小化窗口                                                                            |
| Command + Shift + 3, Command + Shift + 4 | 3 截全屏,4 选择截屏                                                                       |
| Command+d, Command+Shift+d               | 水平分隔当前terminal, 取消分屏                                                            |
| Esc+字母                                 | 解决Mac Option(Alt) 键 + 字母输出特殊希腊字符问题                                         |
| Command + Shift + G                      | MAC Finder 访问/usr /var /tmp等隐藏目录                                                   |

* Problems
** Emacs 使用option键为Meta键步骤：
: Terminal>Proferences>Profiles>Keyboard>Select “Use Option as Meta key”
** 挂载NTFS文件系统为可写模式：
: $ sudo mkdir ~/WD1
: $ sudo mount_ntfs -o rw,nobrowse /dev/disk3s1 ~/WD1

: 或者这样：
: $ sudo mount -t rtfs -o rw,auto,browse /deb/disk3s1 ~/WD1
** Mac版git命令自动补全
1. 安装bash-completion：brew install bash-completion
2. 让git支持自动补全
   : $ git clone https://github.com/git/git.git
   : $ cp git/contrib/completion/git-completion.bash ~/.git-completion.bash
   : $ vim ~/.bash_profile

   : // 追加以下内容：
   : source ~/.git-completion.bash
** 查看 CPU 信息、显示磁盘列表
: $ sysctl -n machdep.cpu.brand_string

: $ diskutil list
** 查看所有用户和组
: $ dscacheutil -q group
** Mac 切换为zsh，安装oh-my-zsh主题家族
1. 下载
   : $ zsh -s path Oh-my-zsh：https://github.com/ohmyzsh/ohmyzsh
2. 主体修改：2019-11-29 
   : 修改~/.oh-my-zsh/themes/pygmalion.zsh-theme 命令行符号为$
3. 修改：运行命令git branch后的行为变得和git branch | less 行为一样
   : 解决：
   : $ git config --global pager.branch false
** App can’t be opened because it is from an unidentified developer
: $ sudo spctl --master-disable
** “iODBC-SDK.pkg” can’t be opened because Apple cannot check it for malicious software. This software needs to be updated. Contact the developer for more information.
: System Preferences > Security & Privacy > Allow Anyway
** 移动硬盘里有很多文件显示灰色无法移动的问题
: 查看文件选项特性
: $ ls -l@

: 删除文件的附加属性
: $ xattr -c *.mp4

: 某些博客和贴吧推荐的以下命令，这样可能删除不彻底：
: $ xattr -d com.apple.FinderInfo *.mp4
** 移动硬盘删除目录时，显示如下信息：
: $  rmdir 23 
: rmdir: 23: Directory not empty

: 解决：
** 执行 brew update 长时间没有反应
: 执行 $ brew update-reset
** gyp: No Xcode or CLT version detected!
: 解决：
: $ xcode-select --print-path
: $ sudo rm -r -f /Library/Developer/CommandLineTools
: $ xcode-select --install
** 指定不升级更新某个软件
: $ brew pin elastic/tap/elasticsearch-full

: // 解除
: $ brew unpin elastic/tap/elasticsearch-full

: // 显示固定了版本的软件包列表
: $ brew list --pinned
** MAC：Read-only file system 问题
1. 重启，禁用SIP（System Integrity Protection）
   : $ csrutil status
   : $ csrutil disable
2. 重新挂载根目录为可写模式
   : $ sudo mount -uw /
** Warning: Failed to set locale category
#+begin_src emacs-lisp
  zrg@zrg-mac:~/Music|⇒  vim ~/.zshrc
  Warning: Failed to set locale category LC_NUMERIC to en_CN.
  Warning: Failed to set locale category LC_TIME to en_CN.
  Warning: Failed to set locale category LC_COLLATE to en_CN.
  Warning: Failed to set locale category LC_MONETARY to en_CN.
  Warning: Failed to set locale category LC_MESSAGES to en_CN
#+end_src

: 解决：
: $ vim ~/.zshrc
: #
: export LANG=en_US.UTF-8

: $ source ~/.zshrc
** npm install 卡顿问题处理
: // 配置国内源
: $ npm config set registry https://registry.npm.taobao.org
: // 这是默认官方源
: $ npm config set registry https://registry.npmjs.org/
** 执行 brew install 命令长时间卡在 Updating Homebrew
: 方法一：按住 control + c 取消本次更新操作
: // 这个方法是临时的、一次性的

: 方法二：使用 Alibaba 的 Homebrew 镜像源进行加速
: 更新以下3个仓库，具体操作：
1. brew.git
   # 替换成阿里巴巴的 brew.git 仓库地址:
   : $ cd "$(brew --repo)"
   : $ git remote set-url origin https://mirrors.aliyun.com/homebrew/brew.git

   # 还原为官方提供的 brew.git 仓库地址
   : $ cd "$(brew --repo)"
   : $ git remote set-url origin https://github.com/Homebrew/brew.git
2. homebrew-core.git
   # 替换成阿里巴巴的 homebrew-core.git 仓库地址:
   : $ cd "$(brew --repo)/Library/Taps/homebrew/homebrew-core"
   : $ git remote set-url origin https://mirrors.aliyun.com/homebrew/homebrew-core.git

   # 还原为官方提供的 homebrew-core.git 仓库地址
   : $ cd "$(brew --repo)/Library/Taps/homebrew/homebrew-core"
   : $ git remote set-url origin https://github.com/Homebrew/homebrew-core.git
3. homebrew-bottles.git
   : 查看当前使用的 shell 版本
   : $ echo $SHELL
   # 如果你的输出结果是 /bin/zsh，参考下方的 zsh 终端操作方式
   # 如果你的输出结果是 /bin/bash，参考下方的 bash 终端操作方式

   # 1)zsh
   # 替换成阿里巴巴的 homebrew-bottles 访问地址:
   : $ echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.aliyun.com/homebrew/homebrew-bottles' >> ~/.zshrc
   : $ source ~/.zshrc

   # 还原为官方提供的 homebrew-bottles 访问地址
   : $ vi ~/.zshrc
   # 然后，删除 HOMEBREW_BOTTLE_DOMAIN 这一行配置
   : $ source ~/.zshrc

   # 替换 homebrew-bottles 访问 URL:
   : $ echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.aliyun.com/homebrew/homebrew-bottles' >> ~/.bash_profile
   : $ source ~/.bash_profile

   # 还原为官方提供的 homebrew-bottles 访问地址
   : $ vi ~/.bash_profile
   # 然后，删除 HOMEBREW_BOTTLE_DOMAIN 这一行配置
   : $ source ~/.bash_profile
** `ping baidu.com`，ping: Lacking privilege for raw socket.
: 原因：
: 通过 brew 安装了工具包：`brew install inetutils`
: 安装以后需要设置 path，所以才有了 export PATH="/usr/local/opt/inetutils/libexec/gnubin:$PATH" 这行。这样会导致 ping 之类的命令都无权限。
: 所以，在 install 之后继续运行`brew link --overrite inetutils`，这样才可以正常使用 ftp 之类的命令。

: 解决：
: 编辑~/.zshrc，inetutils 那行注释就好了。或者使用上述方法解决（我没尝试过）。
