_posts/softwareEngineering/2021-07-03-macbook-pro.html
---
layout: post
title: Macbook Pro
author: zrg
description: Macbook Pro notes.
excerpt: 
comments: false
categories: 
- software
tags:
- Macbook Pro
---

<p>
My email address: zrg1390556486@gmail.com
</p>

<div id="outline-container-org3ee453f" class="outline-2">
<h2 id="org3ee453f"><span class="section-number-2">1</span> Keyboard</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Keyboard</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">Option = Alt,Command = Windows</td>
<td class="org-left">Mac 与 Windows 按键对比</td>
</tr>

<tr>
<td class="org-left">Option+shift+K</td>
<td class="org-left">可以输入</td>
</tr>

<tr>
<td class="org-left">Command+shift+.</td>
<td class="org-left">显示隐藏文件</td>
</tr>

<tr>
<td class="org-left">Command+c,Command+v,Command+option+v</td>
<td class="org-left">复制,粘贴,移动/剪切</td>
</tr>

<tr>
<td class="org-left">Command+option+c</td>
<td class="org-left">快速复制文件绝对路径</td>
</tr>

<tr>
<td class="org-left">option+command+esc</td>
<td class="org-left">强制关闭应用程序</td>
</tr>

<tr>
<td class="org-left">Command+→ , Command+←</td>
<td class="org-left">光标移到行首或行尾和上下翻页，除了使用emacs默认快捷键外，也可以使用command键+上下左右箭头</td>
</tr>

<tr>
<td class="org-left">fn + &lt;x, Ctrl + d</td>
<td class="org-left">删除光标后的字符，相当于&lt;DEL&gt;</td>
</tr>

<tr>
<td class="org-left">Option + &lt;DEL&gt;, Option + d</td>
<td class="org-left">删除光标后的词</td>
</tr>

<tr>
<td class="org-left">Command  + m</td>
<td class="org-left">最小化</td>
</tr>

<tr>
<td class="org-left">Command + 0</td>
<td class="org-left">显示最小化窗口</td>
</tr>

<tr>
<td class="org-left">Command + Shift + 3, Command + Shift + 4</td>
<td class="org-left">3 截全屏,4 选择截屏</td>
</tr>

<tr>
<td class="org-left">Command+d, Command+Shift+d</td>
<td class="org-left">水平分隔当前terminal, 取消分屏</td>
</tr>

<tr>
<td class="org-left">Esc+字母</td>
<td class="org-left">解决Mac Option(Alt) 键 + 字母输出特殊希腊字符问题</td>
</tr>

<tr>
<td class="org-left">Command + Shift + G</td>
<td class="org-left">MAC Finder 访问/usr /var /tmp等隐藏目录</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org45071d3" class="outline-2">
<h2 id="org45071d3"><span class="section-number-2">2</span> Problems</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org783ae2c" class="outline-3">
<h3 id="org783ae2c"><span class="section-number-3">2.1</span> Emacs 使用option键为Meta键步骤：</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
Terminal&gt;Proferences&gt;Profiles&gt;Keyboard&gt;Select “Use Option as Meta key”
</pre>
</div>
</div>
<div id="outline-container-orgcb0529a" class="outline-3">
<h3 id="orgcb0529a"><span class="section-number-3">2.2</span> 挂载NTFS文件系统为可写模式：</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
$ sudo mkdir ~/WD1
$ sudo mount_ntfs -o rw,nobrowse /dev/disk3s1 ~/WD1
</pre>


<pre class="example">
或者这样：
$ sudo mount -t rtfs -o rw,auto,browse /deb/disk3s1 ~/WD1
</pre>
</div>
</div>
<div id="outline-container-org84b4b19" class="outline-3">
<h3 id="org84b4b19"><span class="section-number-3">2.3</span> Mac版git命令自动补全</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>安装bash-completion：brew install bash-completion</li>
<li><p>
让git支持自动补全
</p>
<pre class="example">
$ git clone https://github.com/git/git.git
$ cp git/contrib/completion/git-completion.bash ~/.git-completion.bash
$ vim ~/.bash_profile
</pre>


<pre class="example">
// 追加以下内容：
source ~/.git-completion.bash
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org9d6fac1" class="outline-3">
<h3 id="org9d6fac1"><span class="section-number-3">2.4</span> 查看 CPU 信息、显示磁盘列表</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
$ sysctl -n machdep.cpu.brand_string
</pre>


<pre class="example">
$ diskutil list
</pre>
</div>
</div>
<div id="outline-container-org8c30775" class="outline-3">
<h3 id="org8c30775"><span class="section-number-3">2.5</span> 查看所有用户和组</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
$ dscacheutil -q group
</pre>
</div>
</div>
<div id="outline-container-org50201a5" class="outline-3">
<h3 id="org50201a5"><span class="section-number-3">2.6</span> Mac 切换为zsh，安装oh-my-zsh主题家族</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li><p>
下载
</p>
<pre class="example">
$ zsh -s path Oh-my-zsh：https://github.com/ohmyzsh/ohmyzsh
</pre></li>
<li><p>
主体修改：2019-11-29 
</p>
<pre class="example">
修改~/.oh-my-zsh/themes/pygmalion.zsh-theme 命令行符号为$
</pre></li>
<li><p>
修改：运行命令git branch后的行为变得和git branch | less 行为一样
</p>
<pre class="example">
解决：
$ git config --global pager.branch false
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org6bc0131" class="outline-3">
<h3 id="org6bc0131"><span class="section-number-3">2.7</span> App can’t be opened because it is from an unidentified developer</h3>
<div class="outline-text-3" id="text-2-7">
<pre class="example">
$ sudo spctl --master-disable
</pre>
</div>
</div>
<div id="outline-container-org6d85789" class="outline-3">
<h3 id="org6d85789"><span class="section-number-3">2.8</span> “iODBC-SDK.pkg” can’t be opened because Apple cannot check it for malicious software. This software needs to be updated. Contact the developer for more information.</h3>
<div class="outline-text-3" id="text-2-8">
<pre class="example">
System Preferences &gt; Security &amp; Privacy &gt; Allow Anyway
</pre>
</div>
</div>
<div id="outline-container-org4271da2" class="outline-3">
<h3 id="org4271da2"><span class="section-number-3">2.9</span> 移动硬盘里有很多文件显示灰色无法移动的问题</h3>
<div class="outline-text-3" id="text-2-9">
<pre class="example">
查看文件选项特性
$ ls -l@
</pre>


<pre class="example">
删除文件的附加属性
$ xattr -c *.mp4
</pre>


<pre class="example">
某些博客和贴吧推荐的以下命令，这样可能删除不彻底：
$ xattr -d com.apple.FinderInfo *.mp4
</pre>
</div>
</div>
<div id="outline-container-org59d551b" class="outline-3">
<h3 id="org59d551b"><span class="section-number-3">2.10</span> 移动硬盘删除目录时，显示如下信息：</h3>
<div class="outline-text-3" id="text-2-10">
<pre class="example">
$  rmdir 23 
rmdir: 23: Directory not empty
</pre>


<pre class="example">
解决：
</pre>
</div>
</div>
<div id="outline-container-orga2a4150" class="outline-3">
<h3 id="orga2a4150"><span class="section-number-3">2.11</span> 执行 brew update 长时间没有反应</h3>
<div class="outline-text-3" id="text-2-11">
<pre class="example">
执行 $ brew update-reset
</pre>
</div>
</div>
<div id="outline-container-orgcf782c1" class="outline-3">
<h3 id="orgcf782c1"><span class="section-number-3">2.12</span> gyp: No Xcode or CLT version detected!</h3>
<div class="outline-text-3" id="text-2-12">
<pre class="example">
解决：
$ xcode-select --print-path
$ sudo rm -r -f /Library/Developer/CommandLineTools
$ xcode-select --install
</pre>
</div>
</div>
<div id="outline-container-org5b8bd23" class="outline-3">
<h3 id="org5b8bd23"><span class="section-number-3">2.13</span> 指定不升级更新某个软件</h3>
<div class="outline-text-3" id="text-2-13">
<pre class="example">
$ brew pin elastic/tap/elasticsearch-full
</pre>


<pre class="example">
// 解除
$ brew unpin elastic/tap/elasticsearch-full
</pre>


<pre class="example">
// 显示固定了版本的软件包列表
$ brew list --pinned
</pre>
</div>
</div>
<div id="outline-container-org38ff0a0" class="outline-3">
<h3 id="org38ff0a0"><span class="section-number-3">2.14</span> MAC：Read-only file system 问题</h3>
<div class="outline-text-3" id="text-2-14">
<ol class="org-ol">
<li><p>
重启，禁用SIP（System Integrity Protection）
</p>
<pre class="example">
$ csrutil status
$ csrutil disable
</pre></li>
<li><p>
重新挂载根目录为可写模式
</p>
<pre class="example">
$ sudo mount -uw /
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org3f7bf69" class="outline-3">
<h3 id="org3f7bf69"><span class="section-number-3">2.15</span> Warning: Failed to set locale category</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">zrg@zrg-mac:~/Music|&#8658;  vim ~/.zshrc
Warning: Failed to set locale category LC_NUMERIC to en_CN.
Warning: Failed to set locale category LC_TIME to en_CN.
Warning: Failed to set locale category LC_COLLATE to en_CN.
Warning: Failed to set locale category LC_MONETARY to en_CN.
Warning: Failed to set locale category LC_MESSAGES to en_CN
</pre>
</div>

<pre class="example">
解决：
$ vim ~/.zshrc
#
export LANG=en_US.UTF-8
</pre>


<pre class="example">
$ source ~/.zshrc
</pre>
</div>
</div>
<div id="outline-container-org39cae0d" class="outline-3">
<h3 id="org39cae0d"><span class="section-number-3">2.16</span> npm install 卡顿问题处理</h3>
<div class="outline-text-3" id="text-2-16">
<pre class="example">
// 配置国内源
$ npm config set registry https://registry.npm.taobao.org
// 这是默认官方源
$ npm config set registry https://registry.npmjs.org/
</pre>
</div>
</div>
<div id="outline-container-orga0efecd" class="outline-3">
<h3 id="orga0efecd"><span class="section-number-3">2.17</span> 执行 brew install 命令长时间卡在 Updating Homebrew</h3>
<div class="outline-text-3" id="text-2-17">
<pre class="example">
方法一：按住 control + c 取消本次更新操作
// 这个方法是临时的、一次性的
</pre>


<pre class="example">
方法二：使用 Alibaba 的 Homebrew 镜像源进行加速
更新以下3个仓库，具体操作：
</pre>

<ol class="org-ol">
<li><p>
brew.git
</p>

<pre class="example">
$ cd "$(brew --repo)"
$ git remote set-url origin https://mirrors.aliyun.com/homebrew/brew.git
</pre>


<pre class="example">
$ cd "$(brew --repo)"
$ git remote set-url origin https://github.com/Homebrew/brew.git
</pre></li>
<li><p>
homebrew-core.git
</p>

<pre class="example">
$ cd "$(brew --repo)/Library/Taps/homebrew/homebrew-core"
$ git remote set-url origin https://mirrors.aliyun.com/homebrew/homebrew-core.git
</pre>


<pre class="example">
$ cd "$(brew --repo)/Library/Taps/homebrew/homebrew-core"
$ git remote set-url origin https://github.com/Homebrew/homebrew-core.git
</pre></li>
<li><p>
homebrew-bottles.git
</p>
<pre class="example">
查看当前使用的 shell 版本
$ echo $SHELL
</pre>

<pre class="example">
$ echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.aliyun.com/homebrew/homebrew-bottles' &gt;&gt; ~/.zshrc
$ source ~/.zshrc
</pre>


<pre class="example">
$ vi ~/.zshrc
</pre>

<pre class="example">
$ source ~/.zshrc
</pre>


<pre class="example">
$ echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.aliyun.com/homebrew/homebrew-bottles' &gt;&gt; ~/.bash_profile
$ source ~/.bash_profile
</pre>


<pre class="example">
$ vi ~/.bash_profile
</pre>

<pre class="example">
$ source ~/.bash_profile
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org648d22b" class="outline-3">
<h3 id="org648d22b"><span class="section-number-3">2.18</span> `ping baidu.com`，ping: Lacking privilege for raw socket.</h3>
<div class="outline-text-3" id="text-2-18">
<pre class="example">
原因：
通过 brew 安装了工具包：`brew install inetutils`
安装以后需要设置 path，所以才有了 export PATH="/usr/local/opt/inetutils/libexec/gnubin:$PATH" 这行。这样会导致 ping 之类的命令都无权限。
所以，在 install 之后继续运行`brew link --overrite inetutils`，这样才可以正常使用 ftp 之类的命令。
</pre>


<pre class="example">
解决：
编辑~/.zshrc，inetutils 那行注释就好了。或者使用上述方法解决（我没尝试过）。
</pre>
</div>
</div>
</div>
